<a href="https://colab.research.google.com/github/TRANTHANHDAT94/python_machine_learning/blob/main/Lecture1_machinelearning_Introduction.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [4]:
import numpy as np
import pandas as pd

In [5]:
url = 'https://raw.githubusercontent.com/tdoan89/ml-dataset/main/titanic_preprocessed_01.csv'
titanic = pd.read_csv(url)
titanic.head()

,survived,pclass,age,sibsp,parch,fare,adult_male,embark_town,alive,alone,...,who_man,who_woman,deck_A,deck_B,deck_C,deck_D,deck_E,deck_F,deck_G,deck_Missing
0,0,3,22.0,1,0,7.2500,1,Southampton,no,0,...,1,0,0,0,0,0,0,0,0,1
1,1,1,38.0,1,0,71.2833,0,Cherbourg,yes,0,...,0,1,0,0,1,0,0,0,0,0
2,1,3,26.0,0,0,7.9250,0,Southampton,yes,1,...,0,1,0,0,0,0,0,0,0,1
3,1,1,35.0,1,0,53.1000,0,Southampton,yes,0,...,0,1,0,0,1,0,0,0,0,0
4,0,3,35.0,0,0,8.0500,1,Southampton,no,1,...,1,0,0,0,0,0,0,0,0,1

In [6]:
# Rawring: json, html...

In [7]:
# Clean and Structured 
'''
We have to clean ir so clean ... .
'''

'\nWe have to clean ir so clean ... .\n'

In [8]:
'''
Modelling and Estimation 
'''

'\nModelling and Estimation \n'

In [9]:
"In this level we forcus on Modeling and Estimation"

'In this level we forcus on Modeling and Estimation'

In [10]:
# Servived or not servived

In [11]:
titanic.head()

,survived,pclass,age,sibsp,parch,fare,adult_male,embark_town,alive,alone,...,who_man,who_woman,deck_A,deck_B,deck_C,deck_D,deck_E,deck_F,deck_G,deck_Missing
0,0,3,22.0,1,0,7.2500,1,Southampton,no,0,...,1,0,0,0,0,0,0,0,0,1
1,1,1,38.0,1,0,71.2833,0,Cherbourg,yes,0,...,0,1,0,0,1,0,0,0,0,0
2,1,3,26.0,0,0,7.9250,0,Southampton,yes,1,...,0,1,0,0,0,0,0,0,0,1
3,1,1,35.0,1,0,53.1000,0,Southampton,yes,0,...,0,1,0,0,1,0,0,0,0,0
4,0,3,35.0,0,0,8.0500,1,Southampton,no,1,...,1,0,0,0,0,0,0,0,0,1

In [12]:
titanic.describe()

,survived,pclass,age,sibsp,parch,fare,adult_male,alone,fare_zscore,sex_female,...,who_man,who_woman,deck_A,deck_B,deck_C,deck_D,deck_E,deck_F,deck_G,deck_Missing
count,891.000000,891.000000,889.000000,891.000000,891.000000,891.000000,891.000000,891.000000,8.910000e+02,891.000000,...,891.000000,891.000000,891.000000,891.000000,891.000000,891.000000,891.000000,891.000000,891.000000,891.000000
mean,0.383838,2.308642,30.291918,0.523008,0.381594,32.204208,0.602694,0.602694,-9.382693e-16,0.352413,...,0.602694,0.304153,0.016835,0.052750,0.066218,0.037037,0.035915,0.014590,0.004489,0.772166
std,0.486592,0.836071,13.149215,1.102743,0.806057,49.693429,0.489615,0.489615,1.000000e+00,0.477990,...,0.489615,0.460306,0.128725,0.223659,0.248802,0.188959,0.186182,0.119973,0.066890,0.419670
min,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000,0.000000,0.000000,-2.885481e+00,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,0.000000,2.000000,22.000000,0.000000,0.000000,7.910400,0.000000,0.000000,-8.232830e-01,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,1.000000
50%,0.000000,3.000000,31.000000,0.000000,0.000000,14.454200,1.000000,1.000000,-2.222170e-01,0.000000,...,1.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,1.000000
75%,1.000000,3.000000,36.000000,1.000000,0.000000,31.000000,1.000000,1.000000,5.385797e-01,1.000000,...,1.000000,1.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,1.000000
max,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200,1.000000,1.000000,3.335452e+00,1.000000,...,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000

In [13]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 43 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   survived              891 non-null    int64
 1   pclass                891 non-null    int64
 2   age                   889 non-null    float64
 3   sibsp                 891 non-null    int64
 4   parch                 891 non-null    int64
 5   fare                  891 non-null    float64
 6   adult_male            891 non-null    int64
 7   embark_town           889 non-null    object
 8   alive                 891 non-null    object
 9   alone                 891 non-null    int64
 10  fare_zscore           891 non-null    float64
 11  sex_female            891 non-null    int64
 12  sex_male              891 non-null    int64
 13  age_cat_(-inf, 12.0]  891 non-null    int64
 14  age_cat_(12.0, 18.0]  891 non-null    int64
 15  age_cat_(18.0, 25.0]  891 non-null    int64
 16  age_cat_(25.0, 30.0]  891 non-null    int64
 17  age_cat_(30.0, 35.0]  891 non-null    int64
 18  age_cat_(35.0, 40.0]  891 non-null    int64
 19  age_cat_(40.0, 45.0]  891 non-null    int64
 20  age_cat_(45.0, 50.0]  891 non-null    int64
 21  age_cat_(50.0, 60.0]  891 non-null    int64
 22  age_cat_(60.0, 70.0]  891 non-null    int64
 23  age_cat_(70.0, 80.0]  891 non-null    int64
 24  age_cat_(80.0, inf]   891 non-null    int64
 25  embarked_C            891 non-null    int64
 26  embarked_None         891 non-null    int64
 27  embarked_Q            891 non-null    int64
 28  embarked_S            891 non-null    int64
 29  class_First           891 non-null    int64
 30  class_Second          891 non-null    int64
 31  class_Third           891 non-null    int64
 32  who_child             891 non-null    int64
 33  who_man               891 non-null    int64
 34  who_woman             891 non-null    int64
 35  deck_A                891 non-null    int64
 36  deck_B                891 non-null    int64
 37  deck_C                891 non-null    int64
 38  deck_D                891 non-null    int64
 39  deck_E                891 non-null    int64
 40  deck_F                891 non-null    int64
 41  deck_G                891 non-null    int64
 42  deck_Missing          891 non-null    int64
dtypes: float64(3), int64(38), object(2)
memory usage: 299.4+ KB

In [15]:
import seaborn as sns
import matplotlib.pyplot as plt

In [16]:
titanic_raw = sns.load_dataset('titanic')
titanic_raw.head()
#That is the raw data next step we will try to build the feature engieeerning

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [17]:
# WE . ave to have tool to build modelling

In [19]:
from sklearn.model_selection import train_test_split
from sklearn.tree import DecisionTreeClassifier
from sklearn.metrics import confusion_matrix, plot_confusion_matrix, accuracy_score, precision_score, recall_score

In [20]:
model_data = titanic.drop(columns = ['embark_town','alive'])#have to remove char type basing on type titanic.info()
model_data.dropna(inplace= True) # Drop NAN to remove the noise (we do not need to repair it again)

In [22]:
X_data = model_data.drop(columns='survived')
Y_data = model_data['survived']

In [23]:
model_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 889 entries, 0 to 890
Data columns (total 41 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   survived              889 non-null    int64
 1   pclass                889 non-null    int64
 2   age                   889 non-null    float64
 3   sibsp                 889 non-null    int64
 4   parch                 889 non-null    int64
 5   fare                  889 non-null    float64
 6   adult_male            889 non-null    int64
 7   alone                 889 non-null    int64
 8   fare_zscore           889 non-null    float64
 9   sex_female            889 non-null    int64
 10  sex_male              889 non-null    int64
 11  age_cat_(-inf, 12.0]  889 non-null    int64
 12  age_cat_(12.0, 18.0]  889 non-null    int64
 13  age_cat_(18.0, 25.0]  889 non-null    int64
 14  age_cat_(25.0, 30.0]  889 non-null    int64
 15  age_cat_(30.0, 35.0]  889 non-null    int64
 16  age_cat_(35.0, 40.0]  889 non-null    int64
 17  age_cat_(40.0, 45.0]  889 non-null    int64
 18  age_cat_(45.0, 50.0]  889 non-null    int64
 19  age_cat_(50.0, 60.0]  889 non-null    int64
 20  age_cat_(60.0, 70.0]  889 non-null    int64
 21  age_cat_(70.0, 80.0]  889 non-null    int64
 22  age_cat_(80.0, inf]   889 non-null    int64
 23  embarked_C            889 non-null    int64
 24  embarked_None         889 non-null    int64
 25  embarked_Q            889 non-null    int64
 26  embarked_S            889 non-null    int64
 27  class_First           889 non-null    int64
 28  class_Second          889 non-null    int64
 29  class_Third           889 non-null    int64
 30  who_child             889 non-null    int64
 31  who_man               889 non-null    int64
 32  who_woman             889 non-null    int64
 33  deck_A                889 non-null    int64
 34  deck_B                889 non-null    int64
 35  deck_C                889 non-null    int64
 36  deck_D                889 non-null    int64
 37  deck_E                889 non-null    int64
 38  deck_F                889 non-null    int64
 39  deck_G                889 non-null    int64
 40  deck_Missing          889 non-null    int64
dtypes: float64(3), int64(38)
memory usage: 291.7 KB

In [24]:
# We have to spearte them to train also test 
#trainning_data 
# Doan sai: Type 1 and Type2 
x_train, x_test, y_train, y_test = train_test_split(X_data, Y_data,test_size = 0.2, stratify = Y_data, random_state =420)
#80% for train and 20% for test 
#random_state = 420. Machine leaerning automatically spearate randomly to avoid the effect of database to results

In [25]:
clr = DecisionTreeClassifier() # Định nghĩa mô hình Define the modelling
clr.fit(x_train, y_train) #train modelling

DecisionTreeClassifier()

In [26]:
x_train.head() # We fix as random.seed() control random status of data

,pclass,age,sibsp,parch,fare,adult_male,alone,fare_zscore,sex_female,sex_male,...,who_man,who_woman,deck_A,deck_B,deck_C,deck_D,deck_E,deck_F,deck_G,deck_Missing
814,3,30.5,0,0,8.0500,1,1,-0.805838,0,1,...,1,0,0,0,0,0,0,0,0,1
722,2,34.0,0,0,13.0000,1,1,-0.327946,0,1,...,1,0,0,0,0,0,0,0,0,1
248,1,37.0,1,1,52.5542,1,0,1.064912,0,1,...,1,0,0,0,0,1,0,0,0,0
683,3,14.0,5,2,46.9000,0,0,0.951413,0,1,...,0,0,0,0,0,0,0,0,0,1
657,3,32.0,1,1,15.5000,0,0,-0.152564,1,0,...,0,1,0,0,0,0,0,0,0,1

In [27]:
y_pred = clr.predict(x_test)

In [28]:
y_pred

array([1, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0,
       1, 1, 0, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1, 0, 0, 1, 1, 1, 1, 0,
       1, 0, 1, 1, 0, 1, 0, 1, 1, 1, 0, 0, 1, 0, 0, 1, 0, 0, 0, 1, 0, 0,
       0, 1, 0, 1, 0, 1, 1, 1, 1, 0, 1, 1, 0, 1, 1, 0, 0, 0, 0, 0, 1, 0,
       1, 1, 0, 1, 0, 0, 0, 0, 0, 1, 1, 1, 0, 0, 0, 1, 0, 1, 0, 0, 1, 1,
       0, 0, 0, 1, 0, 1, 0, 0, 1, 1, 1, 1, 0, 0, 1, 0, 1, 0, 0, 1, 0, 0,
       0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 1, 1, 1, 0, 0, 0,
       0, 0, 1, 0, 0, 1, 1, 0, 0, 0, 1, 1, 0, 1, 1, 0, 0, 0, 0, 1, 0, 0,
       0, 0])

In [29]:
#HOwmany % accuracy 
accuracy_score (y_test, y_pred)*100

78.65168539325843

In [30]:
#Confusion matrix để xem đã ntn
plt.figure(figsize= (20,10))
plot_confusion_matrix(clr,x_test,y_test);

In [31]:
#True 00 đoán là chết thì chết thật 89
#False 11 đoán sống thì sống thật 50
#00 người ấy chết nhưng mình đoán sống 18
#01 đoán người chết nhưng lại sống 21

In [32]:
recall_score(y_test,y_pred)*100

73.52941176470588

In [33]:
precision_score(y_test,y_pred)

0.7142857142857143

In [34]:
1- 21/(50+21)

0.704225352112676

# Machine learning là 1 nhánh của trí tuệ nhân tạo

1.   List item
2.   List item


# Thuật toán machine leanrning có 3 loại: suppervisor, unsupervisor and deep learning 


1.   List item
2.   List item
3. Reforced learning 
# Suppervised: regression and classification 
# unsuppervised: cluster
# Reforced learning: Depe learning

# Bí quyết thàh công: Database, Method and Idea
https://www.kaggle.com/ we can cosider 
IDeas: what does it mean?
Mainthings: Feature Engineering 
Goodata: Dataclean, Pre-processing and feature engineering 
good Methodology 
Good Ideas

We can creat the new data to have googo: processing cleaning and feature engineering

# sự khác biệt phân loại và hồi quy: Class: 0,1 also the lable 
# Regression: value 
Thereefore we can check it as classification 
Binarrry: 0,1
Label: cat,dog...

# Giá, Price...: Regression 
Bài toán nhị phân: Classfication nó không có data cụ thể 
For example: Lên 10% hay giảm 7% for example(continously)-> Regression